import React from 'react'
import Navbar from '@/components/navbar/navbar'
import { useRouter } from 'next/router'

const About : React.FC = () => {
    const router = useRouter()
    return (
        <>    
            <Navbar path={router.pathname}></Navbar>
            <h1>אודות</h1>
            <p>השאלון שלנו אוסף את ההעדפות האישיות של המשתמש, כפי שציין, בנוגע למחיר, השימושים הרצויים והחשיבות של כל שימוש למשתמש.</p>
            <p>בעזרת אלגוריתם מיוחד שפיתחנו, כל התכונות מעובדות כדי למצוא את התשובה הטובה ביותר לדרישות האלה. מחשבים ניידים שהאלגוריתם מחשיב כמספקים יוצגו למשתמש, יחד עם דירוג רמת הכשירות לכל מחשב, וכן הסבר מפורט לכל דירוג.</p>
            <p>כל הצעה תספק קישור שמוביל ישירות לאתר שמוכר את אותו מוצר, למען נוחות המשתמש. כאשר המשתמש מקבל החלטה, הוא יוכל לבצע קנייה ישירות מהחנות בה בחרו.</p>
            <p>לאחר שהמוצר מגיע, נהיה יותר משמחים לדעת אם ציפיותכם נפגשו.</p>
            <h1>מטרות לעתיד</h1>
            <p>נכון להיום, אנחנו מתכננים להרחיב את שירותינו מעבר לישראל, ולתמוך בעוד שפות כדי לעזור לכמה שיותר אנשים מרחבי העולם להנות מחווית קניות נוחה, וכן להוסיף עוד סוגי מוצרים מלבד מחשבים ניידים, שמבלבלים באותה מידה לרכוש (למשל, אוזניות, שואבי אבק, מחשבים נייחים).</p>
            <p>בבוא הזמן, אולי נוסיף עוד מטרות אם נראה בכך צורך.</p>
        </>
    )
}

export default About